#include <iostream>
#include <math.h>
#include <stdio.h>
#include <locale.h>
#include <time.h>
using namespace std;

void main()
{

	setlocale(LC_ALL, "Rus");
	int tm, nz;
	do
	{
		system("cls");
		cout << "Выберите тему:" << endl;
		cout << "1) Циклы, использование отладчика " << endl;
		cout << "2) Операторы цикла с условием " << endl;
		cout << "3) Использование условного оператора  после операторов цикла с условием " << endl;
		cout << " Что бы выйти введите '999'" << endl;
		cin >> tm;
		switch (tm)
		{

		case 1:
		{
			cout << "Введите номер задания (от 1 до 5) : ";
			cin >> nz;
			switch (nz)
			{
			case 1:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Даны два целых числа A и B (A < B). Найти все целые числа, " << endl;
				cout << " расположенные между данными числами (включая сами эти числа), " << endl;
				cout << " в порядке их убывания, а также количество N этих чисел " << endl;
				cout << "------------------------------------------------------------------" << endl;
				int a, b, n = 0;
				cout << "Введите число а: ";
				cin >> a;
				cout << "Введите число b: ";
				cin >> b;
				if (a < b)
				{
					for (a; a <= b; a++)
					{
						cout << a << " " << endl;
						n++;
					}
					cout << "Кол-во чисел = " << n << endl;
				}

				system("pause");
			}
			break;

			case 2:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Дано целое число N (> 2) и две вещественные точки на числовой оси: " << endl;
				cout << " A, B (A < B). Функция F(X) задана формулой F(X) = 1 – sin(X). Найти " << endl;
				cout << " значения функции F в N равноотстоящих точках, образующих " << endl;
				cout << " разбиение отрезка [A, B]: F(A), F(A + H), F(A + 2H),... , F(B). " << endl;
				cout << "------------------------------------------------------------------" << endl;

				int i, n, a, b, x;
				cout << "Vvedite N (>= 2): ";
				cin >> n;
				cout << "Vvedite A and B (A < B) " << endl;
				cout << "Vvedite A: ";
				cin >> a;
				cout << "Vvedite B: ";
				cin >> b;

				for (i = 1; i <= n; i++)
				{
					x = a + (b - a) / (n - 1)*(i - 1);
					cout << x - sin(x) << endl;
				}
				system("pause");
			}
			break;

			case 3:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Дано число D (> 0).Последовательность чисел AN определяется " << endl;
				cout << " следующим образом: A1 = 1, A2 = 2, AN = (AN–2+ AN–1)/2, N = 3, 4, ... " << endl;
				cout << " Найти первый из номеров K, для которых выполняется условие " << endl;
				cout << " AK-AK–1 < D, и вывести этот номер, а также числа AK–1 и AK " << endl;
				cout << "------------------------------------------------------------------" << endl;

				int x, d, an, ak, k;
				cout << "Vvedite d: ";
				cin >> d;
				an = 2;
				k = 1;
				ak = 0;
				x = 0;
				while (x < d)
				{
					ak = an;
					an = 2 + 1 / ak;
					x = abs(an - ak);
					k = k + 1;
				}
				cout << "AK= " << ak << " AN= " << an << " K= " << k;
			}
			break;

			case 4:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Задано натуральные числа от 10 до N. Вывести нечетные кратные пяти " << endl;
				cout << " числа. " << endl;
				cout << "------------------------------------------------------------------" << endl;
				std::locale::global(std::locale(""));
				int a = 0, i = 0;
				int b[100];
				cout << "Введите последовательность натуральных чисел,заканчивая числом -1(Конец цикла) " << endl;
				while (true) {
					cin >> a;
					if (a == -1) break;
					if ((a < 100) && (a % 13 == 0)) {
						b[i] = a;
						i++;
					}
				}
				cout << "Последовательность натуральных чисел кратных 13 и меньше 100: " << endl;
				for (int j = 0; j < i; j++)
					cout << b[j] << " ";
				cout << endl;
				system("pause");
			}
			break;

			case 5:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Вывести квадраты чисел от 11 до 99. " << endl;
				cout << "------------------------------------------------------------------" << endl;
				int i, n = 99;
				for (i = 11; i <= n; i++)
				{
					cout << i*i << endl;
				}
				system("pause");
			}
			break;

			default:
				cout << "ERORR!" << endl;
				system("pause");
				break;
			}
		}
		break;

		case 2:
		{
			cout << "Введите номер задания (от 1 до 2) : ";
			cin >> nz;
			switch (nz)
			{
			case 1:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Дана последовательность из n вещественных чисел, начинающаяся с " << endl;
				cout << " отрицательного числа. Определить, какое количество отрицательных " << endl;
				cout << " чисел записано в начале последовательности. Условный оператор не " << endl;
				cout << " использовать " << endl;
				cout << "------------------------------------------------------------------" << endl;

				int n = 5, i, a, k;
				cout << "Vvedi a = ";
				cin >> a;
				k = 1;
				while ((a < 0) && (k < n))
				{
					k = k + 1;
					cout << "Vvedi a = ";
					cin >> a;
				}
				for (i = k; i <= n; i++)
				{
					cout << "Vvedi a = ";
					cin >> a;
					a = k;
				}
				while (a < n)
				{
					k = k - 1;
					a = n;
				}
				cout << k << endl;
				system("pause");
			}
			break;

			case 2:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Дана последовательность целых чисел 1 2 18 , a  в начале которой " << endl;
				cout << " записано несколько равных между собой элементов. Определить " << endl;
				cout << " количество таких элементов последовательности. Условный оператор не " << endl;
				cout << " использовать " << endl;
				cout << "------------------------------------------------------------------" << endl;
				int a1, a2, a3, a4, a5, a6, a7, a8, a9, a10, a11, a12, a13, a14, a15, a16, a17, a18, n, j;
				int* p[18] = { &a1,&a2,&a3,&a4,&a5,&a6,&a7,&a8,&a9,&a10,&a11,&a12,&a13,&a14,&a15,&a16,&a17,&a18 };
				for (j = 0; j < 18; *p[j++] = 4 - rand() % 9);
				for (n = rand() % 17, j = 0; j < n; *p[j++] = *p[0]);

				cout << a1 << '\t' << a2 << '\t' << a3 << '\t' << a4 << '\t' << a5 << '\t' << a6 << '\t' << a7 << '\t' << a8 << '\t' << a9 << '\t' << a10 << '\t' << a11 << '\t' << a12 << '\t' << a13 << '\t' << a14 << '\t' << a15 << '\t' << a16 << '\t' << a17 << '\t' << a18 << endl;

				cout << !(a1^a1) + !(a1^a2) + !(a1^a3) + !(a1^a4) + !(a1^a5) + !(a1^a6) + !(a1^a7) + !(a1^a8) + !(a1^a9) + !(a1^a10) + !(a1^a11) + !(a1^a12) + !(a1^a13) + !(a1^a14) + !(a1^a15) + !(a1^a16) + !(a1^a17) + !(a1^a18) << endl;

				cout << !(a1^a1)
					+ !(a1^a2) * !(a1^a1)
					+ !(a1^a3) * !(a1^a1) * !(a1^a2)
					+ !(a1^a4) * !(a1^a1) * !(a1^a2) * !(a1^a3)
					+ !(a1^a5) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4)
					+ !(a1^a6) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5)
					+ !(a1^a7) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6)
					+ !(a1^a8) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7)
					+ !(a1^a9) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8)
					+ !(a1^a10) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9)
					+ !(a1^a11) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9) * !(a1^a10)
					+ !(a1^a12) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9) * !(a1^a10) * !(a1^a11)
					+ !(a1^a13) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9) * !(a1^a10) * !(a1^a11) * !(a1^a12)
					+ !(a1^a14) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9) * !(a1^a10) * !(a1^a11) * !(a1^a12) * !(a1^a13)
					+ !(a1^a15) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9) * !(a1^a10) * !(a1^a11) * !(a1^a12) * !(a1^a13) * !(a1^a14)
					+ !(a1^a16) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9) * !(a1^a10) * !(a1^a11) * !(a1^a12) * !(a1^a13) * !(a1^a14) * !(a1^a15)
					+ !(a1^a17) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9) * !(a1^a10) * !(a1^a11) * !(a1^a12) * !(a1^a13) * !(a1^a14) * !(a1^a15) * !(a1^a16)
					+ !(a1^a18) * !(a1^a1) * !(a1^a2) * !(a1^a3) * !(a1^a4) * !(a1^a5) * !(a1^a6) * !(a1^a7) * !(a1^a8) * !(a1^a9) * !(a1^a10) * !(a1^a11) * !(a1^a12) * !(a1^a13) * !(a1^a14) * !(a1^a15) * !(a1^a16) * !(a1^a17) << endl;
				system("pause");
			}
			break;

			default:
				cout << "ERORR!" << endl;
				system("pause");

			}
		}
		break;

		case 3:
		{
			cout << "Введите номер задания (от 1 до 2) : ";
			cin >> nz;
			switch (nz)
			{
			case 1:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Известны оценки по информатике каждого из 20 учеников класса. В " << endl;
				cout << " начале списка перечислены все пятерки, затем все остальные оценки. " << endl;
				cout << " Сколько учеников имеют по информатике оценку 5? Условный " << endl;
				cout << " оператор не использовать. Рассмотреть два случая:" << endl;
				cout << " a.	известно, что пятерки имеют не все ученики класса " << endl;
				cout << " b.	допускается, что пятерки могут иметь все ученики класса " << endl;
				cout << "------------------------------------------------------------------" << endl;

				int uo, sum = 1;
				srand(time(NULL));

				for (int i = 1; i <= 20; i++)
				{

					uo = rand() % 4 + 2;
					cout << uo << endl;

				}
				system("pause");
			}
			break;

			case 2:
			{
				cout << "------------------------------------------------------------------" << endl;
				cout << " Известны сведения о количестве осадков, выпавших за каждый день мая. " << endl;
				cout << " Первого мая осадков не было. Определить, в течение какого количества " << endl;
				cout << " первых дней месяца непрерывно, начиная с первого мая, осадков не " << endl;
				cout << " было? Условный оператор не использовать. Рассмотреть два случая: " << endl;
				cout << " a.	известно, что в какие-то дни мая осадки выпадали" << endl;
				cout << " b.	допускается, что осадков могло не быть ни в какой день мая." << endl;
				cout << "------------------------------------------------------------------" << endl;
				
				int n = 31;
				int a = rand() % 31 + 1;
				int i, k = 1, m;
				a = 0;
				cout << "Сколько первых дней? Указать кол-во: ";
				cin >> m;
				cout << "Заполните информацию о каждом дне, начиная со второго" << endl;
				cout << "Вводите через пробел- " << endl;
				for (i = 2; i <= 31; i++)
				{
					cin >> a;
				}
				i = 1;

				while (i = i + 1)
				{
					k *= k;
					if (k > m)
					{
						k = m;
						i = i + 1;
					}
				}
				if (k == 0)
				{
					cout << "Таких дней небыло,кроме 1 мая" << endl;
				}
				else
					k = k + 1;
				cout << "Кол-во таких дней:" << k << endl;
				system("pause");
			}
			break;

			}
			break;

		}
		break;
		}
	} while (tm != 999);



}